In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
    "name": ["Harry","Chintu","shubh","Shanu","Siddhi"],
    "Marks":[92,87,89,90,97],
    "City":["Mumbai","Chennai","Kolkata","Delhi","Bangalore"]
}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df

     name  Marks       City
0   Harry     92     Mumbai
1  Chintu     87    Chennai
2   shubh     89    Kolkata
3   Shanu     90      Delhi
4  Siddhi     97  Bangalore

In [6]:
df.to_csv('friends.csv')

In [7]:
df.to_csv('friends_index-false.csv',index=False)

In [8]:
df.head(2)

     name  Marks     City
0   Harry     92   Mumbai
1  Chintu     87  Chennai

In [9]:
df.tail(2)

     name  Marks       City
3   Shanu     90      Delhi
4  Siddhi     97  Bangalore

In [10]:
df.describe()

           Marks
count   5.000000
mean   91.000000
std     3.807887
min    87.000000
25%    89.000000
50%    90.000000
75%    92.000000
max    97.000000

In [11]:
train= pd.read_csv('Train.csv')

In [12]:
train

   Unnamed: 0  Train  Speed       City
0           0  12234    123     Mumbai
1           1  12343    142    Chennai
2           2  14324    133    Kolkata
3           3  15432    154      Delhi
4           4  12432    122  Bangalore

In [14]:
train['Speed']

0    123
1    142
2    133
3    154
4    122
Name: Speed, dtype: int64

In [15]:
 train['Speed'][0]

123

In [16]:
 train['Speed'][0]= 121

C:\Users\Admin\AppData\Local\Temp\ipykernel_8056\2464956374.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['Speed'][0]= 121

In [17]:
train

   Unnamed: 0  Train  Speed       City
0           0  12234    121     Mumbai
1           1  12343    142    Chennai
2           2  14324    133    Kolkata
3           3  15432    154      Delhi
4           4  12432    122  Bangalore

In [22]:
train.to_csv('train.csv')

In [23]:
train.index= {'first','second','third','fourth','fifth'}

In [25]:
train

        Unnamed: 0  Train  Speed       City
second           0  12234    121     Mumbai
third            1  12343    142    Chennai
first            2  14324    133    Kolkata
fourth           3  15432    154      Delhi
fifth            4  12432    122  Bangalore

In [26]:
train.index = {'A','B','C','D','E'}

In [27]:
train

   Unnamed: 0  Train  Speed       City
E           0  12234    121     Mumbai
B           1  12343    142    Chennai
C           2  14324    133    Kolkata
A           3  15432    154      Delhi
D           4  12432    122  Bangalore

In [28]:
df.to_csv('train_index-false.csv',index=False)

In [29]:
train

   Unnamed: 0  Train  Speed       City
E           0  12234    121     Mumbai
B           1  12343    142    Chennai
C           2  14324    133    Kolkata
A           3  15432    154      Delhi
D           4  12432    122  Bangalore

In [30]:
df.to_csv('train_index-false.csv',index=False)

In [31]:
train

   Unnamed: 0  Train  Speed       City
E           0  12234    121     Mumbai
B           1  12343    142    Chennai
C           2  14324    133    Kolkata
A           3  15432    154      Delhi
D           4  12432    122  Bangalore

In [32]:
train.index = {'A','B','C','D','E'}

In [33]:
train

   Unnamed: 0  Train  Speed       City
E           0  12234    121     Mumbai
B           1  12343    142    Chennai
C           2  14324    133    Kolkata
A           3  15432    154      Delhi
D           4  12432    122  Bangalore

In [34]:
train

   Unnamed: 0  Train  Speed       City
E           0  12234    121     Mumbai
B           1  12343    142    Chennai
C           2  14324    133    Kolkata
A           3  15432    154      Delhi
D           4  12432    122  Bangalore

In [37]:
ser= pd.Series(np.random.rand(34))

In [38]:
type(ser)

pandas.core.series.Series

In [39]:
ser

0     0.682722
1     0.889113
2     0.993032
3     0.784221
4     0.027168
5     0.420558
6     0.589150
7     0.434230
8     0.972136
9     0.627919
10    0.949906
11    0.094690
12    0.416957
13    0.644377
14    0.917680
15    0.717061
16    0.236849
17    0.205782
18    0.307977
19    0.830458
20    0.313461
21    0.721243
22    0.915144
23    0.617152
24    0.462079
25    0.855822
26    0.683366
27    0.819257
28    0.834183
29    0.202166
30    0.630201
31    0.705594
32    0.547769
33    0.239971
dtype: float64